In [61]:
import numpy as np
import pandas as pd

## More ways to create a DataFrame

In [62]:
data_dict = {'x': [1, 2, 3], 'y': np.array([4, 5, 6]), 'z': 100}

In [63]:
# various elements, differnt order of columns
pd.DataFrame(data_dict, index=[100, 200, 300], columns=['z', 'y', 'x'])

       z  y  x
100  100  4  1
200  100  5  2
300  100  6  3

In [67]:
# creating a data frame from a list of dictionaries
data_dict_2 = [{"x": 1, "y": 2, "z": 100}, {"x": 2, "y": 4, "z": 100}, {"x": 33, "y": 8, "z": 100}]
pd.DataFrame(data_dict_2)

    x  y    z
0   1  2  100
1   2  4  100
2  33  8  100

In [68]:
data_dict_2 = [{"x": 1, "y": 2, "z": 100}, {"x": 2, "y": 4, "z": 100}, {"x": 33, "y": 8, "z": 100}]
frame_2 = pd.DataFrame(data_dict_2, index=['a', 'b', 'c'])
frame_2

    x  y    z
a   1  2  100
b   2  4  100
c  33  8  100

In [69]:
frame_2['x']

a     1
b     2
c    33
Name: x, dtype: int64

In [70]:
frame_2.loc['a']

x      1
y      2
z    100
Name: a, dtype: int64

In [71]:
frame_2[['x', 'y']].loc[['a', 'c']]

    x  y
a   1  2
c  33  8

In [72]:
# creating a data frame from a list
frame_3 = pd.DataFrame([[1, 2, 100], [2, 4, 100], [3, 8, 100]], index=['a', 'b', 'c'], columns=['x', 'y', 'z'])
frame_3

   x  y    z
a  1  2  100
b  2  4  100
c  3  8  100

In [73]:
frame_3[['y', 'x']].loc[['b', 'a']]

   y  x
b  4  2
a  2  1

In [74]:
# creating a data frame from a numpy array
arr = np.array([[1, 2, 100], [2, 4, 100], [3, 8, 100]])
frame_4 = pd.DataFrame(arr)
frame_4

   0  1    2
0  1  2  100
1  2  4  100
2  3  8  100

In [75]:
arr[2, 2] = 300
arr

array([[  1,   2, 100],
       [  2,   4, 100],
       [  3,   8, 300]])

In [76]:
# changes in the numpy array led to changes in the frame
frame_4

   0  1    2
0  1  2  100
1  2  4  100
2  3  8  300

In [77]:
# avoiding the changes in the frame
arr = np.array([[1, 2, 100], [2, 4, 100], [3, 8, 100]])
frame_5 = pd.DataFrame(arr, copy=True)
frame_5

   0  1    2
0  1  2  100
1  2  4  100
2  3  8  100

In [78]:
arr[2, 2] = 300
frame_5

   0  1    2
0  1  2  100
1  2  4  100
2  3  8  100

## Creating from an xlxs-file

In [85]:
grades_math_info = pd.read_excel('cs_exam_grades_2005.xlsx', sheet_name = 'МатИнфо')

In [86]:
grades_math_info

,№,Код ОО,Класс,Фамилия,Имя,Отчество,Задания с кратким ответом,Первичный балл,Тестовый балл
0,1,13984,1И3,Акопян,Артём,Хачатурович,++-++++++---+++++-+++++--00,18,72
1,2,13984,1И2,Рысенков,Андрей,Александрович,+++++-+--+-++++++-+++++--02,20,85
2,3,13984,1И4,Петренко,Игорь,Алексеевич,+-++++-+-+-++++++-+++-+--00,17,70
3,4,13984,1И3,Пашкова,Екатерина,Олеговна,+++++++--+-+-+++-++++++-+00,19,75
4,5,13984,1И4,Панарина,Полина,Евгеньевна,+++++-+++++++++++++++-++-02,24,88
...,...,...,...,...,...,...,...,...,...
93,94,13984,1И2,Дятлов,Леонид,Константинович,+++++++-++++++++++++--+--22,24,88
94,95,13984,1И1,Дубинкин,Антон,Владимирович,+++++-+++++-++++--+++----00,17,70
95,96,13984,1И1,Амелин,Иван,Игоревич,+++++-++++-++++++++++++-+00,22,83
96,97,13984,1И1,Романовский,Максим,Алексеевич,++++++++-+---+++-++-+-+--02,18,72
97,98,13984,1И3,Ходосевич,Иван,Сергеевич,+++++--++++++-+++-+-+++--00,18,72

In [87]:
grades_lyc_info = pd.read_excel('cs_exam_grades_2005.xlsx', sheet_name = 'Лицей НИУ ВШЭ')

In [88]:
grades_lyc_info

,№,Код ОО,Класс,Фамилия,Имя,Отчество,Задания с кратким ответом,Первичный балл,Тестовый балл
0,1,13984,1И3,Акопян,Артём,Хачатурович,++-++++++---+++++-+++++--00,18,72
1,2,13984,1В1,Саванин,Сергей,Сергеевич,++++++++++++-+-+--++-----00,16,67
2,3,13984,1И2,Рысенков,Андрей,Александрович,+++++-+--+-++++++-+++++--02,20,78
3,4,13984,1Д1,Рухлов,Арсений,Ильич,++----------------+------00,3,20
4,5,13984,1Э5,Рубцов,Игорь,Владимирович,++++----++-----+--++-+---00,10,51
...,...,...,...,...,...,...,...,...,...
147,148,13984,1Э1,Гуськов,Илья,Дмитриевич,++++-+------++-----------00,7,43
148,149,13984,1Э1,Батурлина,Александра,Сергеевна,+-++-++++++-+++++++++++--00,20,78
149,150,13984,1И1,Амелин,Иван,Игоревич,+++++-++++-++++++++++++-+00,22,83
150,151,13984,1И1,Романовский,Максим,Алексеевич,++++++++-+---+++-++-+-+--02,18,72
151,152,13984,1И3,Ходосевич,Иван,Сергеевич,+++++--++++++-+++-+-+++--00,18,72

In [89]:
grades_lyc_info.index

RangeIndex(start=0, stop=152, step=1)

In [91]:
grades_lyc_info.columns

Index(['№', 'Код ОО', 'Класс', 'Фамилия', 'Имя', 'Отчество',
       'Задания с кратким ответом', 'Первичный балл', 'Тестовый балл'],
      dtype='object')

In [92]:
grades_lyc_info.columns[3]

'Фамилия'